{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_2","layers":[{"class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true,"batch_input_shape":[null,30],"dtype":"float32"}},{"class_name":"Reshape","config":{"target_shape":[16,4],"name":"reshape_Reshape2","trainable":true}},{"class_name":"RNN","config":{"name":"rnn_RNN2","trainable":true,"cells":[{"class_name":"LSTMCell","config":{"name":"lstm_cell_LSTMCell5","trainable":true,"units":16,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null}},{"class_name":"LSTMCell","config":{"name":"lstm_cell_LSTMCell6","trainable":true,"units":16,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null}},{"class_name":"LSTMCell","config":{"name":"lstm_cell_LSTMCell7","trainable":true,"units":16,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null}},{"class_name":"LSTMCell","config":{"name":"lstm_cell_LSTMCell8","trainable":true,"units":16,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null}}],"batch_input_shape":[null,16,4],"dtype":"float32","return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"cell":{"class_name":"StackedRNNCells","config":{"name":"stacked_rnn_cells_StackedRNNCells2","trainable":true,"cells":[{"class_name":"LSTMCell","config":{"name":"lstm_cell_LSTMCell5","trainable":true,"units":16,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null}},{"class_name":"LSTMCell","config":{"name":"lstm_cell_LSTMCell6","trainable":true,"units":16,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null}},{"class_name":"LSTMCell","config":{"name":"lstm_cell_LSTMCell7","trainable":true,"units":16,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null}},{"class_name":"LSTMCell","config":{"name":"lstm_cell_LSTMCell8","trainable":true,"units":16,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null}}]}}}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true,"batch_input_shape":[null,16],"dtype":"float32"}}]},"keras_version":"tfjs-layers 3.18.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3/kernel","shape":[30,64],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[64],"dtype":"float32"},{"name":"rnn_RNN2/RNNCell_0/kernel","shape":[4,64],"dtype":"float32"},{"name":"rnn_RNN2/RNNCell_0/recurrent_kernel","shape":[16,64],"dtype":"float32"},{"name":"rnn_RNN2/RNNCell_0/bias","shape":[64],"dtype":"float32"},{"name":"rnn_RNN2/RNNCell_1/kernel","shape":[16,64],"dtype":"float32"},{"name":"rnn_RNN2/RNNCell_1/recurrent_kernel","shape":[16,64],"dtype":"float32"},{"name":"rnn_RNN2/RNNCell_1/bias","shape":[64],"dtype":"float32"},{"name":"rnn_RNN2/RNNCell_2/kernel","shape":[16,64],"dtype":"float32"},{"name":"rnn_RNN2/RNNCell_2/recurrent_kernel","shape":[16,64],"dtype":"float32"},{"name":"rnn_RNN2/RNNCell_2/bias","shape":[64],"dtype":"float32"},{"name":"rnn_RNN2/RNNCell_3/kernel","shape":[16,64],"dtype":"float32"},{"name":"rnn_RNN2/RNNCell_3/recurrent_kernel","shape":[16,64],"dtype":"float32"},{"name":"rnn_RNN2/RNNCell_3/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.18.0","convertedBy":null}